In [2]:
import numpy as np
import pandas as pd
import requests
import json
import os
import dotenv
# import plotly.express as px
# import statsmodels.formula.api as smf
# import statsmodels.api as sm

In [5]:
awards = pd.read_csv('data/AwardsPlayers.csv')
awards.head()

    playerID                awardID  yearID lgID  tie notes
0   bondto01  Pitching Triple Crown    1877   NL  NaN   NaN
1  hinespa01           Triple Crown    1878   NL  NaN   NaN
2  heckegu01  Pitching Triple Crown    1884   AA  NaN   NaN
3  radboch01  Pitching Triple Crown    1884   NL  NaN   NaN
4  oneilti01           Triple Crown    1887   AA  NaN   NaN

In [7]:
batting = pd.read_csv('data/Batting.csv')
batting.head()

,playerID,yearID,stint,teamID,lgID,G,G_batting,AB,R,H,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,G_old
0,aardsda01,2004,1,SFN,NL,11,NaN,0,0,0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
1,aardsda01,2006,1,CHN,NL,45,NaN,2,0,0,...,0.0,0.0,0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
2,aardsda01,2007,1,CHA,AL,25,NaN,0,0,0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
3,aardsda01,2008,1,BOS,AL,47,NaN,1,0,0,...,0.0,0.0,0,1.0,0.0,0.0,0.0,0.0,0.0,NaN
4,aardsda01,2009,1,SEA,AL,73,NaN,0,0,0,...,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,0.0,NaN

In [8]:
hof = pd.read_csv('data/HallOfFame.csv')
hof.head()

,playerID,yearid,votedBy,ballots,needed,votes,inducted,category,needed_note
0,aaronha01,1982,BBWAA,415.0,312.0,406.0,Y,Player,NaN
1,abbotji01,2005,BBWAA,516.0,387.0,13.0,N,Player,NaN
2,abreubo01,2020,BBWAA,397.0,298.0,22.0,N,Player,NaN
3,abreubo01,2021,BBWAA,401.0,301.0,35.0,N,Player,NaN
4,abreubo01,2022,BBWAA,394.0,296.0,34.0,N,Player,NaN

In [10]:
People = pd.read_csv('data/People.csv')
People.head().T

,0,1,2,3,4
ID,1,2,3,4,5
playerID,aardsda01,aaronha01,aaronto01,aasedo01,abadan01
birthYear,1981.0,1934.0,1939.0,1954.0,1972.0
birthMonth,12.0,2.0,8.0,9.0,8.0
birthDay,27.0,5.0,5.0,8.0,25.0
birthCity,Denver,Mobile,Mobile,Orange,Palm Beach
birthCountry,USA,USA,USA,USA,USA
birthState,CO,AL,AL,CA,FL
deathYear,NaN,2021.0,1984.0,NaN,NaN
deathMonth,NaN,1.0,8.0,NaN,NaN
deathDay,NaN,22.0,16.0,NaN,NaN
deathCountry,NaN,USA,USA,NaN,NaN
deathState,NaN,GA,GA,NaN,NaN
deathCity,NaN,Atlanta,Atlanta,NaN,NaN
nameFirst,David,Hank,Tommie,Don,Andy
nameLast,Aardsma,Aaron,Aaron,Aase,Abad
nameGiven,David Allan,Henry Louis,Tommie Lee,Donald William,Fausto Andres
weight,215.0,180.0,190.0,190.0,184.0
height,75.0,72.0,75.0,75.0,73.0
bats,R,R,R,R,L
throws,R,R,R,R,L
debut,2004-04-06,1954-04-13,1962-04-10,1977-07-26,2001-09-10
bbrefID,aardsda01,aaronha01,aaronto01,aasedo01,abadan01
finalGame,2015-08-23,1976-10-03,1971-09-26,1990-10-03,2006-04-13
retroID,aardd001,aaroh101,aarot101,aased001,abada001

In [12]:
salaries = pd.read_csv('data/Salaries.csv')
salaries.head(10)

   yearID teamID lgID   playerID   salary
0    2004    SFN   NL  aardsda01   300000
1    2007    CHA   AL  aardsda01   387500
2    2008    BOS   AL  aardsda01   403250
3    2009    SEA   AL  aardsda01   419000
4    2010    SEA   AL  aardsda01  2750000
5    2011    SEA   AL  aardsda01  4500000
6    2012    NYA   AL  aardsda01   500000
7    1986    BAL   AL   aasedo01   600000
8    1987    BAL   AL   aasedo01   625000
9    1988    BAL   AL   aasedo01   675000